<template>
    <section class="elems__spells container">
        <page-title>Заклинания</page-title>
        <div class="elems__spells-descr">
            У заклинаний есть перезарядка, зависящая от силы заклинания = уровню заклинания<br>
            У каждого персонажа есть заряды стихий (заряды стихий разделены по уровням)<br>
            Вы можете воспользоваться зарядом стихий, чтобы сократить перезарядку заклинания на уровень заряда стихий<br>
            Зарядом стихий можно воспользоваться только в начале хода<br>
            Количество зарядов стихий увеличивается при повышении уровня, в завимости от вашего класса<br>
            Заряды стихий восстанавливаются на долгом отдыхе<br><br>

            Пример:<br>
            У вас есть заклинание 3 уровня, которое вы использовали, его перезарядка составит 3 хода, что соответствует его уровню<br>
            Если вы используете заряд стихий 3 уровня - перезарядка снимается (заклинание можно использовать на этом ходу)<br>
            Если вы используете заряд стихий 2 уровня - перезарядка сократится на 2 хода и составит 1 ход<br>
            Если вы использовали заклинание 2 уровня и использовали заряд стихий 3 уровня - перезарядка снимается 
            
              
        </div>
    </section>
</template>

<script>
export default {

}
</script>

<style lang="scss">
    .elems__spells {
		&-descr {
			font-size: 27px;
			line-height: 45px;
		}
	}
    @media (max-width: 992px) {
		.elems__spells {
			&-descr {
				font-size: 23px;
				line-height: 35px;
			}
		}
	}
    @media (max-width: 576px) {
		.elems__spells {
			&-descr {
				font-size: 20px;
				line-height: 30px;
			}
		}
	}
</style>