<template>
    <section class="elems__spells">
        <h2 class="elems__spells-title">Заклинания</h2>
        <div class="elems__spells-descr">
            У заклинаний есть перезарядка, зависящая от силы заклинания = уровню заклинания<br>
            Перезарядка начинается с момента применения заклинания + уровень заклинания<br>
            У каждого персонажа, обладающего заклинаниями есть заряды стихий (заряды стихий разделены по уровням)<br>
            Вы можете воспользоваться зарядом стихий, чтобы сократить перезарядку заклинания на уровень заряда стихий<br>
            Зарядом стихий можно воспользоваться только в начале хода<br>
            Заряды стихий восстанавливаются на долгом отдыхе<br><br>

            Пример:<br>
            У вас есть заклинание 3 уровня, которое вы использовали, его перезарядка составит 3 хода, что соответствует его уровню<br>
            Если вы используете заряд стихий 3 уровня - перезарядка снимается (заклинание можно использовать на этом ходу)<br>
            Если вы используете заряд стихий 2 уровня - перезарядка сократится на 2 хода и составит 1 ход<br><br>

            Если использовать заряд стихий более высокого уровня, чем заклинание, то сократится время перезарядки этого заклинания при следующем применении (не более одного раза)<br><br>
            Пример:<br>
            У вас есть заклинание 2 уровня, которое вы использовали, его перезарядка составит 2 хода, что соответствует его уровню<br>
            Если вы используете заряд стихий 3 уровня - перезарядка снимается, при следующем применении перезарядка будет на 1 ход меньше (заряд стихий на 1 больше уровня заклинания)<br>
            Если вы применили заклинание 1 уровня и использовали заряд стихий 3 уровня - перезарядка снимается, при следующем применении её также не будет
              
        </div>
    </section>
</template>

<script>
export default {

}
</script>

<style lang="scss">
    .elems__spells {
		&-title {
			font-size: 50px;
		}
		&-descr {
			font-size: 25px;
			line-height: 45px;
		}
	}
</style>