<template>
  <section class="elems__lore container">
    <page-title>Мир Дайтон</page-title>
    <div class="elems__lore-wrapper">
      <img class="elems__lore-img" :src="worldPreviewImg" alt="Мир">
      <div class="elems__lore-descr">Дайтон - старый мир, который был изменен до неузнаваемости после Великого катаклизма. Процветающий ранее мир теперь строится с начала. Но катаклизм принес не только разрушения, но и новые силы в мир. <br> Стихии - то, что было обнаружено уцелевшими людьми.  Стихиям нашли разное применение: источник энергии, новый источник магии, боевые искусства. В Дайтоне существуют 4 крупных государства: Тиссилия - большая республика на северо-востоке, славится своей выдающейся магической школой. Королевство Люмиос - крупнейший торговый блок Дайтона. Аронвайд - старейшее государство Дайтона, образовано уцелевшими в первые месяцы после Великого Катаклизма, славится своей академией, где готовят лучших бойцов в Дайтоне. Земли Тарондара - совсем недавно открытая земля, на которой только формируются первые поселения и правила. Тарондар невероятно богат ископаемыми, которых ранее не встречали люди.<br><br>
      Важнейшей задачей для людей является изучение Катарата - неизведанного участка земли, в самом эпицентре Великого Катаклизма. Все вылазки, совершенные туда оборачивались трагичным итогом. Кто знает, что это место может скрывать: артефакты, древние боги, иные формы жизни, новые источники энергии. Катарат - по немногочисленной информации - пустынная земля, на которой есть следы старой цивилизации, о которой почти ничего не известно
      </div>
    </div>
  </section>
</template>

<script>
export default {
  computed: {
    worldPreviewImg() {
      return this.$store.getters.worldPreviewImg
    }
  }
}
</script>

<style lang="scss" scoped>
    .elems__lore {
        &-wrapper {
          display: flex;
          justify-content: space-between;
          align-items: center;
        }
        &-img {
          width: 50%;
        }
        &-descr {
          font-size: 25px;
          padding: 0 20px;
        }
    }
    @media (max-width: 1400px) {
		.elems__lore {
			&-wrapper {
				flex-direction: column;
			}
			&-img {
				width: 50%;

			}
			&-descr {
				font-size: 23px;
			}
		}
    }
	@media (max-width: 992px) {
		.elems__lore {
			&-descr {
				font-size: 20px;
			}
		}
	}
	@media (max-width: 768px) {
		.elems__lore {
			&-img {
				width: 100%;
			}
		}
	}
</style>